it/src/Documents/КомплектацияОС/КомплектацияОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КомплектацияОС</name>
  <registerRecords>InformationRegister.КомплектующиеОС</registerRecords>
  <registerRecords>InformationRegister.МестонахождениеОС</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Событие</name>
    <type>
      <types>CatalogRef.СобытияОС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОсновныеСредства</name>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комплектующие</name>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

it/src/Documents/КомплектацияОС/ManagerModule.bsl
// Получить таблицу .
//
Функция ПолучитьТаблицуКоличественныйУчетОС(СтруктураШапкиДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КомплектацияОСКомплектующие.Ссылка КАК Регистратор,
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	               |	КомплектацияОСКомплектующие.Ссылка.Дата КАК Период,
	               |	КомплектацияОСКомплектующие.ОсновноеСредство КАК ОсновноеСредство,
	               |	КомплектацияОСКомплектующие.Количество
	               |ИЗ
	               |	Документ.КомплектацияОС.Комплектующие КАК КомплектацияОСКомплектующие
	               |ГДЕ
	               |	КомплектацияОСКомплектующие.Ссылка = &Ссылка";
	
	 Запрос.УстановитьПараметр("Ссылка",СтруктураШапкиДокумента.Ссылка);
	 Возврат(Запрос.Выполнить().Выгрузить());
	 
КонецФункции // ПолучитьТаблицуКомплектующих()

// Получить таблицу .
//
Функция ПолучитьТаблицуМестонахождениеОС(СтруктураШапкиДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КомплектацияОСКомплектующие.Ссылка КАК Регистратор,
	               |	КомплектацияОСКомплектующие.Ссылка.Дата КАК Период,
	               |	КомплектацияОСКомплектующие.ОсновноеСредство,
	               |	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК Организация,
	               |	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК ПодразделениеОрганизации,
	               |	ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка) КАК МОЛ,
	               |	ЗНАЧЕНИЕ(Справочник.Помещение.ПустаяСсылка) КАК Помещение,
	               |	КомплектацияОСОсновныеСредства.ОсновноеСредство КАК ОСВладелец
	               |ИЗ
	               |	Документ.КомплектацияОС.Комплектующие КАК КомплектацияОСКомплектующие
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КомплектацияОС.ОсновныеСредства КАК КомплектацияОСОсновныеСредства
	               |		ПО КомплектацияОСКомплектующие.КлючСвязи = КомплектацияОСОсновныеСредства.КлючСвязи
	               |			И КомплектацияОСКомплектующие.Ссылка = КомплектацияОСОсновныеСредства.Ссылка
	               |ГДЕ
	               |	КомплектацияОСКомплектующие.Ссылка = &Ссылка";
	
	 Запрос.УстановитьПараметр("Ссылка",СтруктураШапкиДокумента.Ссылка);
	 Возврат(Запрос.Выполнить().Выгрузить());
	 
КонецФункции // ПолучитьТаблицуКомплектующих()

// Получить таблицу .
//
Функция ПолучитьТаблицуКомплектующиеОС(СтруктураШапкиДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КомплектацияОСКомплектующие.Ссылка КАК Регистратор,
	               |	КомплектацияОСКомплектующие.Ссылка.Дата КАК Период,
	               |	ВЫБОР
	               |		КОГДА КомплектацияОСКомплектующие.Количество > 0
	               |			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	               |		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	               |	КОНЕЦ КАК ВидДвижения,
	               |	КомплектацияОСОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	               |	КомплектацияОСКомплектующие.ОсновноеСредство КАК Комплектующая,
	               |	ВЫБОР
	               |		КОГДА КомплектацияОСКомплектующие.Количество > 0
	               |			ТОГДА КомплектацияОСКомплектующие.Количество
	               |		ИНАЧЕ КомплектацияОСКомплектующие.Количество * -1
	               |	КОНЕЦ КАК Количество
	               |ИЗ
	               |	Документ.КомплектацияОС.Комплектующие КАК КомплектацияОСКомплектующие
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КомплектацияОС.ОсновныеСредства КАК КомплектацияОСОсновныеСредства
	               |		ПО КомплектацияОСКомплектующие.КлючСвязи = КомплектацияОСОсновныеСредства.КлючСвязи
	               |			И КомплектацияОСКомплектующие.Ссылка = КомплектацияОСОсновныеСредства.Ссылка
	               |ГДЕ
	               |	КомплектацияОСКомплектующие.Ссылка = &Ссылка";
	
	 Запрос.УстановитьПараметр("Ссылка",СтруктураШапкиДокумента.Ссылка);
	 Возврат(Запрос.Выполнить().Выгрузить());
	 
КонецФункции // ПолучитьТаблицуКомплектующих()
